
//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ 
// 
 
// Обработчик команды ВсеВзаиморасчеты
&НаКлиенте
Процедура ВсеВзаиморасчетыВыполнить()
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	СтруктураПараметров = Новый Структура("ТекущаяСтрока", ТекущаяСтрока);
	ОткрытьФорму("РегистрНакопления.Взаиморасчеты.ФормаСписка", СтруктураПараметров, , Истина);
КонецПроцедуры

&НаСервере
Функция ПолучитьРегистрНакопленияКлючЗаписи(КлючЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Взаиморасчеты.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
		|ГДЕ
		|	Взаиморасчеты.НомерСтроки = &НомерСтроки
		|	И Взаиморасчеты.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("НомерСтроки", КлючЗаписи.НомерСтроки);
	Запрос.УстановитьПараметр("Регистратор", КлючЗаписи.Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Результат = Справочники.Контрагенты.ПустаяСсылка();
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Контрагент;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьРегистрНакопленияКлючЗаписи()


&НаКлиенте
Процедура ТекущиеВзаиморасчеты(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	СтруктураПараметров = Новый Структура("Контрагент", ПолучитьРегистрНакопленияКлючЗаписи(ТекущаяСтрока));
	ОткрытьФорму("РегистрНакопления.Взаиморасчеты.Форма.ТекущиеВзаиморасчеты", СтруктураПараметров, , Истина);
КонецПроцедуры
